frost-msg-spec/msg_spec.html
<!doctype html>
<html lang="en">
<head>
<title>FROST Messages &amp; Data Serialization</title>
<!-- 2021-04-13 Tue 17:46 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Overview</a></li>
<li><a href="#sec-2">2. Headers</a></li>
<li><a href="#sec-3">3. Data</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. Key Generation with DKG</a></li>
<li><a href="#sec-3-2">3.2. Key Generation with Dealer</a></li>
<li><a href="#sec-3-3">3.3. Preprocessing</a></li>
<li><a href="#sec-3-4">3.4. Signing</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">FROST Messages &amp; Data Serialization</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
The following document describes the byte-level structure of messages sent in
FROST. Each message consists of a header of fixed size followed by the actual
payload of the message.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Headers</h2>
<div class="outline-text-2" id="text-2">
<p>
All messages have the following header:
</p>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="right">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-right">Bytes</th>
<th scope="col" class="text-left">Field Name</th>
<th scope="col" class="text-left">Data Type</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-right">1</td>
<td class="text-left">Message Type</td>
<td class="text-left"><code>u8</code></td>
</tr>

<tr>
<td class="text-right">1</td>
<td class="text-left">Version</td>
<td class="text-left"><code>u8</code></td>
</tr>

<tr>
<td class="text-right">2</td>
<td class="text-left">Sender ID</td>
<td class="text-left"><code>u16</code></td>
</tr>

<tr>
<td class="text-right">2</td>
<td class="text-left">Receiver ID</td>
<td class="text-left"><code>u16</code></td>
</tr>
</tbody>
</table>

<p>
The <code>Message Type</code> and <code>Version</code> fields specify the data that follows after the
header. The sender is uniquely identified by the <code>Sender ID</code> field and the receiver
is uniquely identified by the <code>Receiver ID</code> field. 
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Data</h2>
<div class="outline-text-2" id="text-3">
<p>
Messages in FROST are split into four general domains. The following sections
describe each domain and its messages.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Key Generation with DKG</h3>
<div class="outline-text-3" id="text-3-1">
<p>
These messages are sent during the Distributed Key Generation (DKG).
</p>
</div>

<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Round One</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Broadcast the public commitment \(\vec{C}\) and &sigma; <br >
</p>

<p>
<b>Header</b>:<br >
<code>Message Type = 1</code><br >
<code>Version = 1</code><br >
</p>

<p>
<b>Data</b>:
</p>
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Bytes</th>
<th scope="col" class="text-left">Description</th>
<th scope="col" class="text-left">Data Type</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">2</td>
<td class="text-left">Size of the commitment <code>n</code></td>
<td class="text-left"><code>u16</code></td>
</tr>

<tr>
<td class="text-left">512 * <code>n</code></td>
<td class="text-left">Commitments to individual coefficents</td>
<td class="text-left"><code>[AffinePoint; n]</code></td>
</tr>

<tr>
<td class="text-left">TBA</td>
<td class="text-left">&sigma;<sub>i</sub></td>
<td class="text-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Round Two</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Broadcast the Secret Shares
</p>

<p>
<b>Header</b>:<br >
<code>Message Type = 2</code><br >
<code>Version = 1</code>
</p>

<p>
<b>Data</b>:
</p>
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="right">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-right">Bytes</th>
<th scope="col" class="text-left">Description</th>
<th scope="col" class="text-left">Data Type</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-right">256</td>
<td class="text-left">Secret share <code>f_i(l)</code></td>
<td class="text-left"><code>Scalar</code></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>


<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Key Generation with Dealer</h3>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Preprocessing</h3>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Signing</h3>
<div class="outline-text-3" id="text-3-4">
</div><div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> Round One</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
Share Signing Commitments
</p>

<p>
<b>Header</b>:<br >
<code>Message Type = 3</code><br >
<code>Version = 1</code>
</p>

<p>
<b>Data</b>:
</p>
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Bytes</th>
<th scope="col" class="text-left">Description</th>
<th scope="col" class="text-left">Data Type</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">2</td>
<td class="text-left">Number of signing commitments <code>n</code></td>
<td class="text-left"><code>u16</code></td>
</tr>

<tr>
<td class="text-left">1024 * <code>n</code></td>
<td class="text-left">Signing commitments</td>
<td class="text-left"><code>[SigningCommitment; n]</code></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="date">Created: 2021-04-13 Tue 17:46</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="http://orgmode.org">Org-mode</a> 9.3.8)</p>
</div>
</footer>
</body>
</html>
